loadtests/tests.yml
# this is an artillery.io load test script
# can be run with: artillery run tests.yml
config:
  target: "{{ $processEnvironment.ARTILLERY_TARGET_URL }}"
  phases:
    - duration: 20
      arrivalRate: 10
  defaults:
    headers:
      authorization: "{{ $processEnvironment.AUTH_TOKEN }}"
scenarios:
  - flow:
    - get:
        url: "/graphql"
        qs:
          query:
            "
              {
                userFeed {
                  edges {
                    node {
                      id
                    }
                  }
                }
              }
            "